# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\zozo\GitHub\Connection_Parameters1\Connection_Parameters\Connection_Parameters.cydsn\Connection_Parameters.cyprj
# Date: Mon, 11 Jul 2016 08:45:47 GMT
#set_units -time ns
create_clock -name {Clock_1(FFB)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyRouted1} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFCLK} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 12001 24001} [list]


# Component constraints for C:\Users\zozo\GitHub\Connection_Parameters1\Connection_Parameters\Connection_Parameters.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\zozo\GitHub\Connection_Parameters1\Connection_Parameters\Connection_Parameters.cydsn\Connection_Parameters.cyprj
# Date: Mon, 11 Jul 2016 08:45:45 GMT
